In [322]:
dataset_id = "datamart"

In [2]:
!bq --location=US mk --dataset {dataset_id}

Dataset 'coastal-well-303101:datamart' successfully created.

In [10]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood
ADD COLUMN titleType STRING

Empty DataFrame
Columns: []
Index: []

In [13]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood
ADD COLUMN primaryTitle STRING

Empty DataFrame
Columns: []
Index: []

In [14]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood
ADD COLUMN isAdult BOOL

Empty DataFrame
Columns: []
Index: []

In [17]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood
ADD COLUMN endYear INT64

Empty DataFrame
Columns: []
Index: []

In [18]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood
ADD COLUMN runtimeMinutes INT64

Empty DataFrame
Columns: []
Index: []

In [20]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood
ADD COLUMN averageRating FLOAT64

Empty DataFrame
Columns: []
Index: []

In [21]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood
ADD COLUMN numVotes INT64

Empty DataFrame
Columns: []
Index: []

In [313]:
%%bigquery
CREATE TABLE datamart.movie_title
AS ((SELECT
     tconst AS titleID,
     titleType,   
     primaryTitle,
     originalTitle,
     CAST(
         CASE 
             WHEN isAdult = '0'
                 THEN False
             ELSE True
         END AS BOOL) AS isAdult,
     CAST(
         CASE 
             WHEN startYear = '\\N' 
                 THEN NULL 
             ELSE startYear
         END AS INT64) AS startYear,
     CAST(
         CASE 
             WHEN endYear = '\\N'
                 THEN NULL 
             ELSE endYear
         END AS INT64) AS endYear,
     CAST(
         CASE 
             WHEN runtimeMinutes = '\\N' 
                 THEN NULL 
             ELSE runtimeMinutes
         END AS INT64) AS runTimeMinutes,
     genres
   FROM IMDb_staging.title_basics)
UNION DISTINCT
   (SELECT
    GENERATE_UUID() AS titleID,
    titleType,
    Title,
    Title,
    isAdult,
    Year,
    endYear,
    runtimeMinutes,
    Genre
   FROM kaggle_staging.bollywood))

Empty DataFrame
Columns: []
Index: []

In [309]:
%%bigquery
CREATE TABLE datamart.episode
AS (SELECT
    tconst AS titleID,
    tconst AS parentTitleID,
    CAST(
         CASE 
             WHEN seasonNumber = '\\N' 
                 THEN NULL 
             ELSE seasonNumber
         END AS INT64) AS seasonNumber,
    CAST(
         CASE 
             WHEN episodeNumber = '\\N' 
                 THEN NULL 
             ELSE episodeNumber
         END AS INT64) AS episodeNumber
    FROM IMDb_staging.title_episode)

Empty DataFrame
Columns: []
Index: []

In [314]:
%%bigquery
CREATE TABLE datamart.title_akas
AS (SELECT
     titleID,
     CAST(
         CASE 
             WHEN ordering = '\\N'
                 THEN NULL 
             ELSE ordering
         END AS INT64) AS ordering,
     title,
     region,
     language,
     attributes,
     types,
     CAST(
         CASE 
             WHEN isOriginalTitle = '0'
                 THEN False
             ELSE True
         END AS BOOL) AS isOriginalTitle
    FROM IMDb_staging.title_akas)

Empty DataFrame
Columns: []
Index: []

In [156]:
%%bigquery
ALTER TABLE IMDb_staging.name_basics
ADD COLUMN height INT64

Empty DataFrame
Columns: []
Index: []

In [157]:
%%bigquery
ALTER TABLE IMDb_staging.name_basics
ADD COLUMN debut_as_lead_role string

Empty DataFrame
Columns: []
Index: []

In [160]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood_actors
ADD COLUMN birthYear INT64

Empty DataFrame
Columns: []
Index: []

In [161]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood_actors
ADD COLUMN deathYear INT64

Empty DataFrame
Columns: []
Index: []

In [162]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood_actors
ADD COLUMN debut_as_lead_role string

Empty DataFrame
Columns: []
Index: []

In [315]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood_actors
ADD COLUMN primaryProfession string

Empty DataFrame
Columns: []
Index: []

In [316]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood_actors
ADD COLUMN knownForTitles string

Empty DataFrame
Columns: []
Index: []

In [163]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood_actress
ADD COLUMN birthYear INT64

Empty DataFrame
Columns: []
Index: []

In [164]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood_actress
ADD COLUMN deathYear INT64

Empty DataFrame
Columns: []
Index: []

In [317]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood_actress
ADD COLUMN primaryProfession string

Empty DataFrame
Columns: []
Index: []

In [318]:
%%bigquery
ALTER TABLE kaggle_staging.bollywood_actress
ADD COLUMN knownForTitles string

Empty DataFrame
Columns: []
Index: []

In [319]:
%%bigquery
CREATE TABLE datamart.name
AS ((SELECT
     nconst AS nameID,
     primaryName,
     CAST(
         CASE 
             WHEN birthYear = '\\N' 
                 THEN NULL 
             ELSE birthYear
         END AS INT64) AS birthYear,
     CAST(
         CASE 
             WHEN deathYear = '\\N' 
                 THEN NULL 
             ELSE deathYear
         END AS INT64) AS deathYear,
     height,
     debut_as_lead_role,
     primaryProfession,
     knownForTitles
   FROM IMDb_staging.name_basics)
UNION DISTINCT
   (SELECT
    GENERATE_UUID() AS nameID,
    Name,
    birthYear,
    deathYear,
    Height_in_cm_,
    debut_as_lead_role,
    primaryProfession,
    knownForTitles
   FROM kaggle_staging.bollywood_actors)
UNION DISTINCT
   (SELECT
    GENERATE_UUID() AS nameID,
    Name,
   birthYear,
   deathYear,
   Height_in_cm_,
   debut_aslead_role,
   primaryProfession,
   knownForTitles
   FROM kaggle_staging.bollywood_actress))

Empty DataFrame
Columns: []
Index: []

In [320]:
%%bigquery
CREATE TABLE datamart.principals
AS ((SELECT
     tconst AS titleID,
     ordering,
     nconst AS nameID,
     category,
     job,
     characters AS character
    FROM IMDb_staging.title_principals))

Empty DataFrame
Columns: []
Index: []

In [326]:
%%bigquery
CREATE TABLE datamart.ratings
AS ((SELECT
     tconst AS titleID,
     averageRating,
     numVotes,
     FROM IMDb_staging.title_ratings))

Empty DataFrame
Columns: []
Index: []

In [327]:
%%bigquery
CREATE TABLE datamart.crew
AS ((SELECT
     tconst AS titleID,
     directors,
     writers
     FROM IMDb_staging.title_crew))

Empty DataFrame
Columns: []
Index: []

4/29/2021
The below query returns all the columns of 10 records from the datamart.movie_title table where the movie's primary title starts with 'a'. It is ordered by the movie's length in descending order limited to 10 results.

In [226]:
%%bigquery
SELECT *
FROM datamart.movie_title
WHERE primaryTitle LIKE 'a%'
ORDER BY runTimeMinutes DESC
LIMIT 10

,titleID,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runTimeMinutes
0,tt8677204,movie,adrusta jhatakudu,adrusta jhatakudu,False,1971.0,NaN,137
1,tt10580248,video,a-ha: MTV Unplugged - Summer Solstice,a-ha: MTV Unplugged - Summer Solstice,False,2017.0,NaN,115
2,tt9324808,movie,aTypical Wednesday,aTypical Wednesday,False,2020.0,NaN,91
3,tt1825208,video,abracadabra,abracadabra,False,2001.0,NaN,88
4,tt5650602,movie,aMari,aMari,False,2016.0,NaN,86
5,tt5142810,movie,an archive of one boy's sex education,an archive of one boy's sex education,False,2015.0,NaN,83
6,tt2148738,movie,abuela mambo,abuela mambo,False,2012.0,NaN,82
7,tt0181275,movie,a.k.a. Cassius Clay,a.k.a. Cassius Clay,False,1970.0,NaN,79
8,tt7527512,movie,aKasha,aKasha,False,2018.0,NaN,78
9,tt7689676,movie,are the green fields gone?,are the green fields gone?,False,NaN,NaN,77

4/29/2021
The below query groups together all records that have a run time greater than 100 minutes, by their run time. It returns the count of all the records as well as their run time ordered by the count in descending order, limited to 10 results.

In [241]:
%%bigquery
SELECT COUNT(*) c, runTimeMinutes
FROM datamart.movie_title
GROUP BY runTimeMinutes
HAVING runTimeMinutes > 100
ORDER BY c DESC
LIMIT 10

       c  runTimeMinutes
0  20001             120
1   8983             110
2   8480             105
3   5090             102
4   5026             115
5   4964             180
6   4573             104
7   4389             103
8   4376             101
9   3757             108

4/29/2021
The below query returns all the columns for movies that have a run time longer than the average run time for the movie's title type. It is ordered by the release year in descending order and limited to 10 results.

In [289]:
%%bigquery
SELECT *
FROM datamart.movie_title t1
WHERE runTimeMinutes > (SELECT AVG(runTimeMinutes)
                       FROM datamart.movie_title t2
                       WHERE t1.titleType = t2.titleType)
ORDER BY startYear DESC
LIMIT 10

,titleID,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runTimeMinutes
0,tt11208024,video,Probable Mystery: The Mystery Man,Probable Mystery: The Mystery Man,False,2026,NaN,165
1,tt14130154,movie,Caribou Village,Caribou Village,False,2025,NaN,125
2,tt3661636,movie,51 Christopher Street,51 Christopher Street,False,2024,NaN,120
3,tt13984144,movie,S.P.E.E.D.,S.P.E.E.D.,False,2023,NaN,240
4,tt10284138,movie,The Red Prince,El Principe Rojo,False,2023,NaN,120
5,tt12247022,movie,Carlo's American Dream,Carlo's American Dream,False,2023,NaN,110
6,tt13328802,movie,Shadows of Gandhi,Shadows of Gandhi,False,2023,NaN,90
7,tt12356138,movie,The Cursed Empire,The Cursed Empire,False,2023,NaN,150
8,tt13628848,movie,Santa's Silent Knight,Santa's Silent Knight,False,2023,NaN,93
9,tt13049668,movie,WOW: Way Out West,WOW: Way Out West,False,2023,NaN,90

4/29/2021
The below query returns the title type, primary title, and run time for movies that have their primaryTitle the same as their original title. It limits the result to 10.

In [285]:
%%bigquery
SELECT titleType, primaryTitle, runTimeMinutes
FROM (SELECT titleType, primaryTitle, runTimeMinutes
     FROM datamart.movie_title t1
     WHERE primaryTitle = originalTitle)
LIMIT 10

   titleType                   primaryTitle  runTimeMinutes
0       None                         Nagina             NaN
1       None                    Meri Amanat             NaN
2       None                      Bhai Jaan             NaN
3       None                       The Guru             NaN
4       None                   Hirji Kamdar             NaN
5       None                       Alam Ara             NaN
6  videoGame                    Moon Lander             NaN
7  tvSpecial  P 4 - Ein Film ber Festivals            45.0
8  videoGame                   Space Battle             NaN
9  tvSpecial        Johnny Cash i Kbenhavn            56.0

4/29/2021
The below query returns all of the columns for the movie (any medium for recording) with the highest run time in its title type (category).

In [295]:
%%bigquery
SELECT *
FROM datamart.movie_title t1
WHERE runTimeMinutes = (SELECT MAX(runTimeMinutes)
                       FROM datamart.movie_title t2
                       WHERE t1.titleType = t2.titleType)

,titleID,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runTimeMinutes
0,tt12095652,video,The Longest Video on YouTube: 596.5 Hours,The Longest Video on YouTube: 596.5 Hours,False,2011.0,NaN,35791
1,tt8273150,movie,Logistics,Logistics,False,2012.0,NaN,51420
2,tt11707418,tvMovie,Svalbard Minute by Minute,Svalbard minutt for minutt,False,2020.0,NaN,13319
3,tt0423682,tvMiniSeries,Kya no yjinb,Kya no yjinb,False,1973.0,NaN,1755
4,tt14354950,short,Black Hole,Black Hole,False,NaN,NaN,805
5,tt0466521,tvSeries,The Sharing Circle,The Sharing Circle,False,1991.0,2008.0,8400
6,tt5236758,tvShort,Bob's Broken Sleigh,Bob's Broken Sleigh,False,2015.0,NaN,46
7,tt7357138,tvSpecial,Katy Perry Live: Witness World Wide,Katy Perry Live: Witness World Wide,False,2017.0,NaN,5760
8,tt14384752,videoGame,Big Chungus,Big Chungus,False,2018.0,NaN,1987
9,tt13281504,tvEpisode,P3aksjonen 2020,P3aksjonen 2020,False,2020.0,NaN,6000

In [287]:
dataset_id = "reports"

In [288]:
!bq --location=US mk --dataset {dataset_id}

Dataset 'coastal-well-303101:reports' successfully created.

In [297]:
%%bigquery
CREATE VIEW reports.Longer_Than_Average_View AS
    SELECT t1.*
    FROM datamart.movie_title t1
    WHERE runTimeMinutes > (SELECT AVG(runTimeMinutes)
                           FROM datamart.movie_title t2
                           WHERE t1.titleType = t2.titleType)
    ORDER BY startYear DESC

Empty DataFrame
Columns: []
Index: []

In [298]:
%%bigquery
CREATE VIEW reports.Longest_in_category AS
    SELECT t1.*
    FROM datamart.movie_title t1
    WHERE runTimeMinutes = (SELECT MAX(runTimeMinutes)
                           FROM datamart.movie_title t2
                           WHERE t1.titleType = t2.titleType)

Empty DataFrame
Columns: []
Index: []